<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Basic-operations-with-dataframes" data-toc-modified-id="Basic-operations-with-dataframes-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Basic operations with dataframes</a></span><ul class="toc-item"><li><span><a href="#Select:-column" data-toc-modified-id="Select:-column-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Select: column</a></span></li><li><span><a href="#Select:-subset" data-toc-modified-id="Select:-subset-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Select: subset</a></span></li><li><span><a href="#Get-the-unique-values-​​of-a-column" data-toc-modified-id="Get-the-unique-values-​​of-a-column-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Get the unique values ​​of a column</a></span></li></ul></li><li><span><a href="#Filtering" data-toc-modified-id="Filtering-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Filtering</a></span><ul class="toc-item"><li><span><a href="#by-the-value-of-the-columns" data-toc-modified-id="by-the-value-of-the-columns-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>by the value of the columns</a></span></li><li><span><a href="#df.loc-&amp;-df.iloc" data-toc-modified-id="df.loc-&amp;-df.iloc-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>df.loc &amp; df.iloc</a></span><ul class="toc-item"><li><span><a href="#Based-on-label:-loc" data-toc-modified-id="Based-on-label:-loc-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>Based on label: <code>loc</code></a></span></li><li><span><a href="#Based-on-index:--iloc" data-toc-modified-id="Based-on-index:--iloc-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>Based on index:  <code>iloc</code></a></span></li></ul></li><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Rename columns</a></span><ul class="toc-item"><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Rename columns</a></span></li></ul></li><li><span><a href="#Change-the-data-type-of-a-column" data-toc-modified-id="Change-the-data-type-of-a-column-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Change the data type of a column</a></span></li><li><span><a href="#Copy-a-dataframe" data-toc-modified-id="Copy-a-dataframe-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Copy a dataframe</a></span></li></ul></li><li><span><a href="#deleting" data-toc-modified-id="deleting-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>deleting</a></span><ul class="toc-item"><li><span><a href="#delete-columns" data-toc-modified-id="delete-columns-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>delete columns</a></span></li><li><span><a href="#delete-rows" data-toc-modified-id="delete-rows-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>delete rows</a></span></li></ul></li><li><span><a href="#working-with-the-index" data-toc-modified-id="working-with-the-index-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>working with the index</a></span></li><li><span><a href="#Operations-between-columns" data-toc-modified-id="Operations-between-columns-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Operations between columns</a></span><ul class="toc-item"><li><span><a href="#creating-columns" data-toc-modified-id="creating-columns-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>creating columns</a></span></li><li><span><a href="#apply:-mapping-a-function-to-columns-/-rows" data-toc-modified-id="apply:-mapping-a-function-to-columns-/-rows-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>apply: mapping a function to columns / rows</a></span></li></ul></li><li><span><a href="#Deleting-the-duplicates" data-toc-modified-id="Deleting-the-duplicates-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Deleting the duplicates</a></span></li><li><span><a href="#Null-values" data-toc-modified-id="Null-values-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Null values</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#It-is-null?" data-toc-modified-id="It-is-null?-7.0.1"><span class="toc-item-num">7.0.1&nbsp;&nbsp;</span>It is null?</a></span></li><li><span><a href="#Is-NOT-null?" data-toc-modified-id="Is-NOT-null?-7.0.2"><span class="toc-item-num">7.0.2&nbsp;&nbsp;</span>Is NOT null?</a></span></li><li><span><a href="#Sum-the-null-values-​​of-each-column" data-toc-modified-id="Sum-the-null-values-​​of-each-column-7.0.3"><span class="toc-item-num">7.0.3&nbsp;&nbsp;</span>Sum the null values ​​of each column</a></span></li></ul></li><li><span><a href="#delete-null-values" data-toc-modified-id="delete-null-values-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>delete null values</a></span></li><li><span><a href="#How-to-fill-in-the-missing-data" data-toc-modified-id="How-to-fill-in-the-missing-data-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>How to fill in the missing data</a></span></li></ul></li><li><span><a href="#Export-data" data-toc-modified-id="Export-data-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Export data</a></span></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

![](https://files.realpython.com/media/How-to-Speed-Up-Your-Pandas-Projects_Watermarked.87866cfe1bc2.jpg)

In [22]:
import pandas as pd
import numpy as np

## Basic operations with dataframes

### Select: column

In [23]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [25]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
7087,40,2017-03-26,1.38,236515.28,133157.9,29086.58,355.97,73914.83,53280.49,10526.56,10107.78,conventional,2017,NewOrleansMobile

In [26]:
df["Date"]

0        2015-12-27
1        2015-12-20
2        2015-12-13
3        2015-12-06
4        2015-11-29
            ...
18244    2018-02-04
18245    2018-01-28
18246    2018-01-21
18247    2018-01-14
18248    2018-01-07
Name: Date, Length: 18249, dtype: object

In [27]:
df.Date

0        2015-12-27
1        2015-12-20
2        2015-12-13
3        2015-12-06
4        2015-11-29
            ...
18244    2018-02-04
18245    2018-01-28
18246    2018-01-21
18247    2018-01-14
18248    2018-01-07
Name: Date, Length: 18249, dtype: object

### Select: subset

In [31]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [34]:
df_albany = df[df["region"] == "Albany"]
df_albany.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
5629,13,2017-10-01,1.69,71205.11,4411.02,57416.25,77.85,9299.99,5069.66,4230.33,0.0,conventional,2017,Albany

In [39]:
# Date & Region

df_2 = df[["Date", "region"]]
df_2.sample()

             Date   region
14178  2016-10-23  Seattle

### Get the unique values ​​of a column

In [40]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [41]:
df.year.unique()

array([2015, 2016, 2017, 2018])

`df.column.unique()`

`df.column.value_counts()`

In [42]:
df.year.value_counts()

year
2017    5722
2016    5616
2015    5615
2018    1296
Name: count, dtype: int64

In [ ]:
# Unions & joins & concatenations in pandas: tomorrow

## Filtering

### by the value of the columns

In [44]:
# avocados that are organic
df[df["type"] == "organic"].sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
11508,42,2015-03-08,1.44,56752.92,28363.69,5523.96,0.0,22865.27,22753.34,111.93,0.0,organic,2015,SouthCentral

In [45]:
df[df["year"] > 2016].sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
16749,47,2017-02-05,1.77,9668.72,219.34,3567.45,282.75,5599.18,5467.43,131.75,0.0,organic,2017,RaleighGreensboro

In [46]:
condition_1 = df["type"] == "organic"

In [54]:
condition_2 = df["year"] > 2017

In [47]:
df[condition_1].sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
12453,0,2016-12-25,1.75,4561.12,543.08,2287.13,0.0,1730.91,1588.03,142.88,0.0,organic,2016,Columbus

In [53]:
df[(df["type"] == "organic") & (df["year"] > 2017)].sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18066,9,2018-01-21,1.58,12458.09,521.57,3808.38,90.71,8037.43,6246.99,1790.44,0.0,organic,2018,RichmondNorfolk

In [49]:
df[condition_1 & condition_2].sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
17804,11,2018-01-07,1.51,21095.12,208.15,312.97,13.01,20560.99,20550.99,10.0,0.0,organic,2018,HarrisburgScranton

`watch out for | symbol`

In [ ]:
# EITHER organic OR > 2017
    # all of the organic anytime (if 2016, it'll be organic)
    # organic AND conventional after 2017

In [79]:
df[condition_1 | condition_2].sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
16059,46,2017-02-12,1.29,5966.83,295.27,8.03,0.0,5663.53,4157.77,1505.76,0.0,organic,2017,MiamiFtLauderdale

In [81]:
df[(df["type"] == "conventional") & (df["year"] >= 2015)]

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.00,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.00,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.00,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.00,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.00,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9121,7,2018-02-04,0.76,1272039.80,531469.08,368948.26,13078.20,358544.26,127833.03,229786.03,925.20,conventional,2018,WestTexNewMexico
9122,8,2018-01-28,0.85,957086.16,479147.93,179489.19,7314.98,291134.06,143430.96,147376.43,326.67,conventional,2018,WestTexNewMexico
9123,9,2018-01-21,0.84,1020913.20,505263.29,177911.40,9468.95,328269.56,118978.50,209131.06,160.00,conventional,2018,WestTexNewMexico
9124,10,2018-01-14,0.90,950954.60,463945.73,188126.02,11227.47,287655.38,125408.69,162040.02,206.67,conventional,2018,WestTexNewMexico
9125,11,2018-01-07,0.88,880266.52,436282.38,178669.53,9467.11,255847.50,99686.92,155870.58,290.00,conventional,2018,WestTexNewMexico

In [85]:
average_avocado_price = df["AveragePrice"].mean()
average_avocado_price

1.405978409775878

In [86]:
condition_1 = df["type"] == "organic"
condition_2 = df["year"] > 2017
condition_3 = df["AveragePrice"] > average_avocado_price

In [101]:
# EITHER (condition_1 and 2),  OR condition_3

df[((df["type"] == "organic") & (df["year"] > 2017)) | (df["AveragePrice"] > average_avocado_price)]

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
21,21,2015-08-02,1.45,75133.10,509.94,62035.06,741.08,11847.02,11768.52,78.50,0.0,conventional,2015,Albany
32,32,2015-05-17,1.43,109857.47,1150.55,81955.16,94.32,26657.44,26285.43,372.01,0.0,conventional,2015,Albany
274,14,2015-09-20,1.54,60624.47,1445.25,39831.66,88.61,19258.95,18437.84,821.11,0.0,conventional,2015,BuffaloRochester
275,15,2015-09-13,1.59,73043.20,1572.71,48468.73,134.33,22867.43,22421.87,445.56,0.0,conventional,2015,BuffaloRochester
276,16,2015-09-06,1.56,76139.58,1471.69,49388.48,173.32,25106.09,25092.76,13.33,0.0,conventional,2015,BuffaloRochester
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

`df[(condition_1 & condition_2) | condition_3]`

In [106]:
# df[(condition_1 & condition_2) or condition_3]

In [96]:
# EITHER (condition_1 and 2),  OR condition_3

df[(condition_1 & condition_2) | condition_3]
# watch out for | symbol

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
21,21,2015-08-02,1.45,75133.10,509.94,62035.06,741.08,11847.02,11768.52,78.50,0.0,conventional,2015,Albany
32,32,2015-05-17,1.43,109857.47,1150.55,81955.16,94.32,26657.44,26285.43,372.01,0.0,conventional,2015,Albany
274,14,2015-09-20,1.54,60624.47,1445.25,39831.66,88.61,19258.95,18437.84,821.11,0.0,conventional,2015,BuffaloRochester
275,15,2015-09-13,1.59,73043.20,1572.71,48468.73,134.33,22867.43,22421.87,445.56,0.0,conventional,2015,BuffaloRochester
276,16,2015-09-06,1.56,76139.58,1471.69,49388.48,173.32,25106.09,25092.76,13.33,0.0,conventional,2015,BuffaloRochester
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

### df.loc & df.iloc

In [110]:
df.head(5)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [113]:
df.iloc[4] # Index

Unnamed: 0                 4
Date              2015-11-29
AveragePrice            1.28
Total Volume         51039.6
4046                  941.48
4225                43838.39
4770                   75.78
Total Bags           6183.95
Small Bags           5986.26
Large Bags            197.69
XLarge Bags              0.0
type            conventional
year                    2015
region                Albany
Name: 4, dtype: object

#### Based on label: `loc`

The loc method can be used in two different ways: select rows or columns based on a label, or select rows or columns based on a condition.

In [114]:
df.loc[4] # value itself

Unnamed: 0                 4
Date              2015-11-29
AveragePrice            1.28
Total Volume         51039.6
4046                  941.48
4225                43838.39
4770                   75.78
Total Bags           6183.95
Small Bags           5986.26
Large Bags            197.69
XLarge Bags              0.0
type            conventional
year                    2015
region                Albany
Name: 4, dtype: object

In [116]:
# class Series ():
    #def __init__(self, data, index):
    
# 1. The data    
some_data = {
    "Ohio": 87654,
    "Texas": 678,
    "Oregon": 6789,
    "Utah": 5678,
    "something_else": 567
}


# 2. Overwriting the index
states = ["Ohio", "Texas", "oregón", "Utah", "California"]

# 3. Instantiating the series: Index will become the states list

my_series = pd.Series(data = some_data, index = states)
df_2 = pd.DataFrame(my_series)
df_2

                  0
Ohio        87654.0
Texas         678.0
oregón          NaN
Utah         5678.0
California      NaN

`df.iloc[rows, columns]`

In [124]:
df_2.iloc[0]

0    87654.0
Name: Ohio, dtype: float64

In [126]:
df_2.loc["Ohio"]

0    87654.0
Name: Ohio, dtype: float64

In [121]:
#df_2.iloc["California"] # Index: IIIIIIIloc -> IIIIIIndex

In [123]:
df_2.loc["California"] # LLLLLLLLLable, LLLLOC, LLLLLabel

0   NaN
Name: California, dtype: float64

#### Based on index:  `iloc`

The iloc method is used on DataFrames to select elements based on their location. Its syntax is data.iloc[<filas>, <columnas>], where <filas> and <columnas> are the position of the rows and columns that you want to select in the order that they appear in the object. A familiar notation for Matlab users. In a DataFrame, each of the rows has a number that goes from 0 to the total number of rows minus one. Being iloc the method that allows selecting the data based on these numbers. The same applies to columns.

In iloc there are two arguments rows and columns. In case the second is omitted, all columns in the row will be selected. So to select different rows can be used.

loc syntax with multiple conditions
```python
df.loc[(df["column"] condition) & (df["column"] condition)]
````

### Rename columns

#### Rename columns

`.rename(dict_)`

In [127]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
14840,46,2017-02-12,1.07,11072.75,1085.35,4061.87,0.0,5925.53,200.31,5725.22,0.0,organic,2017,Atlanta

In [133]:
df.rename(columns={"AveragePrice":"averageprice"})

,Unnamed: 0,Date,averageprice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [ ]:
# Axis 0: rows
# Axis 1: columns

In [ ]:
# If we see it: probably I'm seeing a copy
# If I don't see it: it changed on the object

In [156]:
df.rename({"AveragePrice":"THE PRICE"}, axis=1, inplace=True)

In [146]:
df.rename({"Date":"THE DATEEEEEEE"}, axis=1, inplace=True)

# INPLACE = TRUE, makes sure that you do change the object

In [147]:
df

,Unnamed: 0,THE DATEEEEEEE,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

The rename method allows me to rename only the columns that I want, the ones that are in the dictionary. No need to rename all at once

`overwriting attributes`: Requires a list with the same number of columns

In [158]:
df.sample()

,Unnamed: 0,THE DATEEEEEEE,THE PRICE,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
12735,22,2016-07-24,1.67,112800.57,5835.96,65676.84,11.15,41276.62,23564.35,17712.27,0.0,organic,2016,GreatLakes

In [163]:
# lowercase
# substitute spaces for _

df.columns = [i.lower().replace(" ", "_") for i in df.columns]

In [164]:
comp_dict = {i : i.lower().replace(" ", "_") for i in df.columns}
comp_dict

{'Unnamed: 0': 'unnamed:_0',
 'THE DATEEEEEEE': 'the_dateeeeeee',
 'THE PRICE': 'the_price',
 'Total Volume': 'total_volume',
 '4046': '4046',
 '4225': '4225',
 '4770': '4770',
 'Total Bags': 'total_bags',
 'Small Bags': 'small_bags',
 'Large Bags': 'large_bags',
 'XLarge Bags': 'xlarge_bags',
 'type': 'type',
 'year': 'year',
 'region': 'region'}

In [166]:
df.rename(columns = comp_dict, inplace=True) # or it goes puf

### Change the data type of a column

### Copy a dataframe

In [167]:
df_copy = df.copy()

In [168]:
df_copy

,unnamed:_0,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

## deleting

### delete columns

In [169]:
df.sample()

,unnamed:_0,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
14747,6,2017-11-19,1.75,2506.38,0.0,252.98,0.0,2253.4,2250.07,3.33,0.0,organic,2017,Albany

In [171]:
df.sample()

,unnamed:_0,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
13104,27,2016-06-19,1.23,110087.71,15800.4,36039.49,11.01,58236.81,58189.62,47.19,0.0,organic,2016,LosAngeles

In [172]:
df.drop(columns = ["unnamed:_0"], inplace=True)

In [173]:
df.sample()

,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
2767,2015-10-11,0.89,638486.47,268061.13,258518.68,31027.33,80879.33,79841.99,1037.34,0.0,conventional,2015,WestTexNewMexico

In [175]:
df.drop(["total_bags"], axis=1) # KeyError: "['total_bags'] not found in axis"

,the_dateeeeeee,the_price,total_volume,4046,4225,4770,small_bags,large_bags,xlarge_bags,type,year,region
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9408.07,97.49,0.0,conventional,2015,Albany
2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8042.21,103.14,0.0,conventional,2015,Albany
3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5677.40,133.76,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...
18244,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [ ]:
# TWO MAIN THINGS PANDAS
    # INPLACE = TRUE
    # AXIS = 0 OR 1
    # Not found in axis: typos: spaces, case-sensitive

In [177]:
df.columns

Index(['the_dateeeeeee', 'the_price', 'total_volume', '4046', '4225', '4770',
       'total_bags', 'small_bags', 'large_bags', 'xlarge_bags', 'type', 'year',
       'region'],
      dtype='object')

In [176]:
#df.drop(["total_bags"]) # KeyError: "['total_bags'] not found in axis"

### delete rows

In [179]:
df.head()

,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [182]:
df.drop([2, 3], inplace=False)

,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
5,2015-11-22,1.26,55979.78,1184.27,48067.99,43.61,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
6,2015-11-15,0.99,83453.76,1368.92,73672.72,93.26,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

Rows can also be deleted. Note that the indexes are not reset. The index is associated with the row, not the order.
Can the index be restarted? Correct

## working with the index

We read the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) to understand some parameters

`set_index`

In [194]:
#df.set_index("year")
#df[df.index == 2018]

In [198]:
#df.set_index("year", inplace=True)
#df.reset_index()

In [195]:
df.reset_index()
#df[df["year"] == 2018]
df

,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [188]:
df.iloc[2018]
df.loc[2018]

the_dateeeeeee         2015-03-08
the_price                    1.19
total_volume            177541.37
4046                     50712.87
4225                     64964.66
4770                     10295.75
total_bags               51568.09
small_bags               51568.09
large_bags                    0.0
xlarge_bags                   0.0
type                 conventional
year                         2015
region            RichmondNorfolk
Name: 2018, dtype: object

In [184]:
df.set_index("year", inplace=False)

,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,region
year,,,,,,,,,,,,
2015,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,Albany
2015,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,Albany
2015,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,Albany
2015,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,Albany
2015,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...
2018,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,WestTexNewMexico
2018,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,WestTexNewMexico
2018,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,WestTexNewMexico
2018,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,WestTexNewMexico
2018,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,WestTexNewMexico

In [183]:
df.sample()

,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
13138,2016-10-23,1.03,3422.91,5.11,1408.29,0.0,2009.51,126.67,1882.84,0.0,organic,2016,Louisville

`reset_index`

What can we use to have the date as an index?
We will see it later, to analyze temporary series

In [89]:
# index: unique
# an order
# maybe  before passing it to new libraries

## Operations between columns

### creating columns

In [274]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [276]:
df["fare_two"] = df["Fare"] * 2

In [277]:
df.sample()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,fare_two
488,0,3,"Somerton, Mr. Francis William",male,30.0,0,0,A.5. 18509,8.05,NaN,S,16.1

`as the result of an operation between other columns`

In [278]:
df["fare_two_random"] = df["Fare"] * df["Age"]

### apply: mapping a function to columns / rows

`apply to a pd.Series`

In [281]:
# applying functions
    # to columns
    # cast into ints

df.dropna(inplace=True)
df["Age"] = df["Age"].apply(lambda cell: int(cell))

In [ ]:
#np.where(value > 10, condition_2, else)

In [283]:
def cast_into_int (age_input):
    return age * 100 / df.Age.mean()


df["Age_random_no_sense"] = df["Age"].apply(cast_into_int)
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,fare_two,fare_two_random,Age_random_no_sense
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,142.5666,2708.7654,106.558382
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S,106.2000,1858.5000,98.145878
6,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S,103.7250,2800.5750,151.425069
10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7000,G6,S,33.4000,66.8000,11.216672
11,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.5500,C103,S,53.1000,1539.9000,162.641741

Applies a function along an axis of the DataFrame.
[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

When I do an apply on a column, even though I use a lambda, I don't put axis because in the case below, what I'm doing is modifying a column, I use lambda to tell the apply that the first argument is a string that comes from outside and the second argument is the dataframe's own record.

In [ ]:
# PANDAS
    # Objt1: Series
    # Objt2: Dataframes


# lambda
    # lambda to a column: ARG: SERIE
    # lambda to a daframe: ARG: DATAFRAME, one more dimension

`apply to a df`: watch for axis arg

In [292]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
13403,14,2016-09-18,2.36,45701.82,4207.74,13327.73,1497.47,26668.88,26583.76,85.12,0.0,organic,2016,NewYork

In [ ]:
df.to_csv("../avocado.csv", index=False) # When exporting, index=False to prevent Unnamed: 0 column

In [ ]:
df["Unnamed: 0"]

In [293]:
df["new_column_lmabda"] = df["AveragePrice"].apply(lambda x: round(x))

In [294]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region,new_column_lmabda
154,50,2015-01-11,1.17,670231.94,51460.64,420837.82,42526.96,155406.52,151330.87,4075.65,0.0,conventional,2015,BaltimoreWashington,1

In [295]:
# Passing a apply to the whole thing

# small bags
# large bags
# xlrge bags

def random_operation_bags (a, b, c):
    d = a * b * c / 100
    return d

In [ ]:
# apply in a dataframe -> function to each cell / row
# map in an iterable, function to each element

In [ ]:
# IF PASSING an apply (fn)
    # to a DF
    # we're passing as arg: THE WHOLE ROW, 2d
    # access the values by using the brackets -> row["colname"]
    # axis = 1!!!!!!!!!!!!

In [298]:
df["bags_random"] = df.apply(lambda x: random_operation_bags(x["Small Bags"], x["Large Bags"], x["XLarge Bags"]), axis=1)

# 2d: columns, rows

In [299]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region,new_column_lmabda,bags_random
17878,1,2018-03-18,1.38,4573.23,0.0,1367.86,0.0,3205.37,1470.9,1734.47,0.0,organic,2018,Louisville,1,0.0

`lambda & defined function`

`pass two arguments`: one from column, another one from me

## Deleting the duplicates

[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html)

`duplicated()`

In [266]:
df_2 = pd.DataFrame({"A": ["California", "California", "Utah"], "B": ["ssssss", "ssssss", "Utah"], "C": ["a", "b", "c"]})

In [267]:
df_2

            A       B  C
0  California  ssssss  a
1  California  ssssss  b
2        Utah    Utah  c

In [268]:
df_duplicated = df_2[["A", "B"]]
df_duplicated

            A       B
0  California  ssssss
1  California  ssssss
2        Utah    Utah

In [270]:
df_duplicated.drop_duplicates()

            A       B
0  California  ssssss
2        Utah    Utah

In [271]:
df_2

            A       B  C
0  California  ssssss  a
1  California  ssssss  b
2        Utah    Utah  c

In [273]:
df_2.drop_duplicates(subset=["A", "B"])

            A       B  C
0  California  ssssss  a
1  California  ssssss  b
2        Utah    Utah  c

In [255]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

`drop_duplicates()`

In [254]:
df.drop_duplicates(inplace=False)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

```python
for row, series in df.iterrows():
    print(series['T1'], series['T2'],series['T3'])
```

`keep`: False, first/last

In [ ]:
df.drop_duplicates(keep="last")

## Null values

#### It is null?

`pd.isna()` == `pd.isnull()`

In [199]:
df.sample()

,the_dateeeeeee,the_price,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,region
year,,,,,,,,,,,,
2016,2016-07-03,0.87,250902.49,106013.67,46053.0,354.02,98481.8,74730.82,23750.98,0.0,conventional,Nashville

In [202]:
pd.isna(df).sum()

the_dateeeeeee    0
the_price         0
total_volume      0
4046              0
4225              0
4770              0
total_bags        0
small_bags        0
large_bags        0
xlarge_bags       0
type              0
region            0
dtype: int64

In [204]:
pd.isnull(df).sum()

the_dateeeeeee    0
the_price         0
total_volume      0
4046              0
4225              0
4770              0
total_bags        0
small_bags        0
large_bags        0
xlarge_bags       0
type              0
region            0
dtype: int64

#### Is NOT null?

In [210]:
pd.notna(df).sum()

the_dateeeeeee    18249
the_price         18249
total_volume      18249
4046              18249
4225              18249
4770              18249
total_bags        18249
small_bags        18249
large_bags        18249
xlarge_bags       18249
type              18249
region            18249
dtype: int64

#### Sum the null values ​​of each column

### delete null values
There are several ways to do this, we take into account the "how" parameter and of course [the docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

`Dropping missing values where all are missing values`

In [211]:
df = pd.read_csv("../datasets/titanic.csv")

In [213]:
df.isna().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [ ]:
# all -> all the rows that empty
# any -> if ANY Na in the row, drop the row

In [ ]:
# How much you need that NA
# Embarked: 

# Making decision
    # best decision: suits best the need you have for your goal

`Dropping missing values where there's ANY`

`how`: any

With "any" (parameter that comes by default so be careful not to put anything) all the records in which there is a NaN in any column are deleted

In [215]:
df.isna().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [223]:
df.shape[0]

891

In [225]:
df.dropna(how="any", inplace=True)

In [240]:
df.iloc[182] #Index k
#df.loc[502] #Label? no

Survived                        1
Pclass                          1
Name        Behr, Mr. Karl Howell
Sex                          male
Age                          26.0
SibSp                           0
Parch                           0
Ticket                     111369
Fare                         30.0
Cabin                        C148
Embarked                        C
Name: 889, dtype: object

In [232]:
df.shape[0]

183

`how`: all

In [214]:
df.dropna(how="all")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

`thresh`: int

### How to fill in the missing data

How about a little [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

`fillna`

In [243]:
df = pd.read_csv("../datasets/titanic.csv")
df.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [244]:
the_mean = df.Age.mean()
the_mean

29.69911764705882

In [241]:
df["Age"] # fill the values with some info?

1      38.0
3      35.0
6      54.0
10      4.0
11     58.0
       ...
871    47.0
872    33.0
879    56.0
887    19.0
889    26.0
Name: Age, Length: 183, dtype: float64

In [249]:
df.fillna("EMPTY VALUE", inplace=False)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,EMPTY VALUE,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,EMPTY VALUE,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,EMPTY VALUE,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,EMPTY VALUE,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,EMPTY VALUE,1,2,W./C. 6607,23.4500,EMPTY VALUE,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,EMPTY VALUE,Q

In [245]:
df.Age.fillna(the_mean)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [ ]:
# Disucssion
    # Preventing Missing values
    # Making them up

In [ ]:
# predict the age based on the rest of rows

In [ ]:
#fillna: all the rows, you may need it

df.fillna()

## Export data

`to_csv`

In [247]:
df.to_csv("titanic_modified.csv")

In [248]:
df_titanic_modified = pd.read_csv("titanic_modified.csv")
df_titanic_modified

,Unnamed: 0,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

`to_json`

**REMINDER:** `inplace=True` if for method to modify the DF, otherwise you need to save it into a new variable.

# EXERCISE 📝

1. **READ** the sperstore.csv dataset from the datasets folder

In [284]:
# your code here

2. **RENAME** the columns: make them all into lower case AND substitute spaces for inderscores. Eg.: `Order ID` -> `order_id`

In [ ]:
# your code here

3. **DROP** the `Row ID` column

In [286]:
# your code here

4. **FILTER** the dataset where the customer is: `Roy Französisch`

In [287]:
# your code here

5. **CREATE a SUBSET** of the dataframe with the columns: `Ship Mode`, `Segment`, `Country`, `Category`, `Profit`

In [288]:
# your code here

6. **CALCULATE** the SUM of the profit: it should be a formatted print() the says `Roy Französisch amounted a total profit of X $`

In [289]:
# your code here

8. **EXPORT** the csv with the name: `customer_example.csv`

In [290]:
# your code here

7. **DEFINE** (ENCAPSULATE) into a FUNCTION
    - Function name: profit_per_customer
    - Function args: name, string. the name of the customer to filter by
        - to do this, you will have to change the line where you filter to change the literal "Roy Französisch" for name
        - also change it in the formatted print
    - Function should do steps: 1-8
    - include the line: `df_imported = pd.read_csv("customer_example.csv")`
    - Function return: it should return the `df_imported`

In [ ]:
# your code here

8. **CALL**: `df_claire = profit_per_customer("Roy Französisch")`

In [ ]:
# your code here

9. **Run**: `df_claire`

In [ ]:
# your code here

10. **Re-use your own function**: how much did `Erica Smith` amounted in profit? Make sure you save it into a variable named `df_erica_smith`

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)
* [Categories on df](https://runebook.dev/en/docs/pandas/user_guide/categorical)